CREATE DATABASE PropertyDB  
ON							  -- Задаем параметры Базы Данных.
(
	NAME = 'ProperyDB',				-- Указываем логическое имя БД (используется при обращении к БД).
	FILENAME = 'D:\PropertyDB.mdf',		-- Указываем Физическое полное имя файла БД.
	SIZE = 10MB,                    -- Задаем начальный размер файла БД.
	MAXSIZE = 100MB,				-- Задаем максимальный размер файла БД.
	FILEGROWTH = 10MB				-- Задаем значение, на которое будет увеличиваться размер файла БД.
)
LOG ON						  -- Задаем параметры журнала Базы Данных.
( 
	NAME = 'LogPropertyDB',				   -- Указываем логическое имя журнала БД (используется при обращении к журналу БД).
	FILENAME = 'D:\PropertyDB.ldf',        -- Указываем Физическое полное имя файла журнала БД.
	SIZE = 5MB,                        -- Задаем начальный размер файла журнала БД.
	MAXSIZE = 50MB,                    -- Задаем максимальный размер файла журнала БД.
	FILEGROWTH = 5MB                   -- Задаем значение, на которое будет увеличиваться размер файла журнала БД.
)               
COLLATE Cyrillic_General_CI_AS -- Задаем кодировку для базы данных по умолчанию

USE PropertyDB

--Drop table Property

CREATE TABLE Property
(
	Код smallint IDENTITY NOT NULL,
	Тип_угоди Varchar(20) NOT NULL,
	Тип_нерухомості Varchar(20) NOT NULL,
	Район Varchar(20) NOT NULL,
	Адреса Varchar(50) NOT NULL,
	Ціна money NOT NULL,
	Загальна_площа Real NOT NULL,
	Жила_площа Real NULL,
	Кількість_кімнат smallint NULL,
	Кількість_поверхів tinyint NULL,
	Поверх tinyint NULL,
	Наявність_ліфту Varchar(10) NULL,
	Стан_нерухомості Varchar(15) NULL, 
	Найближча_ст_метро Varchar(20) NULL,
	Час_до_метро char(10) NULL,
	Телефон char(15) NOT NULL,
	Email Varchar(30) NULL,
	Коментар Varchar(200) NULL
)
GO 

INSERT INTO Property             -- Ключевое слово INTO можно не использовать.
(Тип_угоди, Тип_нерухомості, Район, Адреса, Ціна, Загальна_площа, Жила_площа, Кількість_кімнат, Кількість_поверхів, Поверх, Наявність_ліфту, Стан_нерухомості, Найближча_ст_метро, Час_до_метро, Телефон, Email) -- Указание порядка записи данных.
VALUES
('Продаж', 'Будинок', 'Дніпровський','пров. Четвертий Садовий, 19',300000, 96, 60, 3, 1, NULL, NULL, 'після ремонту', 'Лівобережна',20, '093*******', NULL),
('Продаж', 'Квартира', 'Дніпровський','вул. Гната Хоткевича, 12',250000, 62, 38, 2, 34, 30, '3 ліфта', 'новобудова', 'Чернігівська',10, '093*******', NULL),
('Аренда', 'Кімната', 'Дніпровський','вул. Гната Хоткевича, 12',3000, 46, 16, 1, 16, 8, '2 ліфта', 'після ремонту', 'Дарниця',10, '093*******', NULL),
('Аренда', 'Офіс', 'Печерський', 'вул. Задніпровського, 13', 13000, 3713.8, NULL, NULL, 10, NULL, '2 ліфта', 'хороший','Печерська',15,'+38(044)2861472','info@bc.co.ua'),
('Аренда', 'Офіс', 'Печерський', 'бул. Лесі Українки, 26', 11000, 12278, NULL, NULL, 9, NULL, '2 ліфта', 'хороший','Печерська',10,'+38(044)2852936','info@bc.co.ua'),
('Аренда', 'Офіс', 'Печерський', 'бул. Лесі Українки, 34', 10000, 7050.4, NULL, NULL, 7, NULL, 'відсутній','хороший','Дружби народів',10,'+38(044)2852936','info@bc.co.ua');
GO

--delete Property

Select * from Property